{
  "messages": [
    {
      "text": "The Data Science skill no one talks about...\n\nEvery aspiring data scientist I talk to thinks their job starts when someone else gives them:\n    1. a dataset, and\n    2. a clearly defined metric to optimize for, e.g. accuracy\n\nBut it doesn’t.\n\nIt starts with a business problem you need to understand, frame, and solve. This is the key data science skill that separates senior from junior professionals.\n\nLet’s go through an example.\n\nExample\n\nImagine you are a data scientist at Uber. And your product lead tells you:\n\n    👩‍💼: “We want to decrease user churn by 5% this quarter”\n\nWe say that a user churns when she decides to stop using Uber.\n\nBut why?\n\nThere are different reasons why a user would stop using Uber. For example:\n\n   1.  “Lyft is offering better prices for that geo” (pricing problem)\n   2. “Car waiting times are too long” (supply problem)\n   3. “The Android version of the app is very slow” (client-app performance problem)\n\nYou build this list ↑ by asking the right questions to the rest of the team. You need to understand the user’s experience using the app, from HER point of view.\n\nTypically there is no single reason behind churn, but a combination of a few of these. The question is: which one should you focus on?\n\nThis is when you pull out your great data science skills and EXPLORE THE DATA 🔎.\n\nYou explore the data to understand how plausible each of the above explanations is. The output from this analysis is a single hypothesis you should consider further. Depending on the hypothesis, you will solve the data science problem differently.\n\nFor example…\n\nScenario 1: “Lyft Is Offering Better Prices” (Pricing Problem)\n\nOne solution would be to detect/predict the segment of users who are likely to churn (possibly using an ML Model) and send personalized discounts via push notifications. To test your solution works, you will need to run an A/B test, so you will split a percentage of Uber users into 2 groups:\n\n    The A group. No user in this group will receive any discount.\n\n    The B group. Users from this group that the model thinks are likely to churn, will receive a price discount in their next trip.\n\nYou could add more groups (e.g. C, D, E…) to test different pricing points.\n\nIn a nutshell\n    1. Translating business problems into data science problems is the key data science skill that separates a senior from a junior data scientist.\n2. Ask the right questions, list possible solutions, and explore the data to narrow down the list to one.\n3. Solve this one data science problem",
      "sender": "Data Science & Machine Learning",
      "date": "2024-11-25T18:13:02+00:00",
      "is_edited": false,
      "edit_date": null,
      "id": 2010,
      "sender_type": "Channel"
    },
    {
      "text": "Basics of Machine Learning 👇👇\n\nFree Resources to learn Machine Learning: https://t.me/free4unow_backup/587\n\nMachine learning is a branch of artificial intelligence where computers learn from data to make decisions without explicit programming. There are three main types:\n\n1. Supervised Learning: The algorithm is trained on a labeled dataset, learning to map input to output. For example, it can predict housing prices based on features like size and location.\n\n2. Unsupervised Learning: The algorithm explores data patterns without explicit labels. Clustering is a common task, grouping similar data points. An example is customer segmentation for targeted marketing.\n\n3. Reinforcement Learning: The algorithm learns by interacting with an environment. It receives feedback in the form of rewards or penalties, improving its actions over time. Gaming AI and robotic control are applications.\n\nKey concepts include:\n\n- Features and Labels: Features are input variables, and labels are the desired output. The model learns to map features to labels during training.\n\n- Training and Testing: The model is trained on a subset of data and then tested on unseen data to evaluate its performance.\n\n- Overfitting and Underfitting: Overfitting occurs when a model is too complex and fits the training data too closely, performing poorly on new data. Underfitting happens when the model is too simple and fails to capture the underlying patterns.\n\n- Algorithms: Different algorithms suit various tasks. Common ones include linear regression for predicting numerical values, and decision trees for classification tasks.\n\nIn summary, machine learning involves training models on data to make predictions or decisions. Supervised learning uses labeled data, unsupervised learning finds patterns in unlabeled data, and reinforcement learning learns through interaction with an environment. Key considerations include features, labels, overfitting, underfitting, and choosing the right algorithm for the task.\n\nJoin @datasciencefun for more \n\nENJOY LEARNING 👍👍",
      "sender": "Data Science & Machine Learning",
      "date": "2024-11-26T09:42:52+00:00",
      "is_edited": false,
      "edit_date": null,
      "id": 2011,
      "sender_type": "Channel"
    },
    {
      "text": "Data Science Roadmap \n👇👇\nhttps://www.linkedin.com/posts/sql-analysts_python-datascience-activity-7267195650532917249-tRW3",
      "sender": "Data Science & Machine Learning",
      "date": "2024-11-26T16:53:30+00:00",
      "is_edited": false,
      "edit_date": null,
      "id": 2012,
      "sender_type": "Channel"
    },
    {
      "text": "FREE Resources Only for Indian Users\n👇👇\nhttps://chat.whatsapp.com/BxZRqk8Zw694S4gCOoIXA1",
      "sender": "Data Science & Machine Learning",
      "date": "2024-11-27T08:55:50+00:00",
      "is_edited": false,
      "edit_date": null,
      "id": 2013,
      "sender_type": "Channel"
    },
    {
      "text": "Breaking into Data Science doesn’t need to be complicated.\n\nIf you’re just starting out,\n\nHere’s how to simplify your approach:\n\nAvoid:\n🚫 Trying to learn every tool and library (Python, R, TensorFlow, Hadoop, etc.) all at once.\n🚫 Spending months on theoretical concepts without hands-on practice.\n🚫 Overloading your resume with keywords instead of impactful projects.\n🚫 Believing you need a Ph.D. to break into the field.\n\nInstead:\n\n✅ Start with Python or R—focus on mastering one language first.\n✅ Learn how to work with structured data (Excel or SQL) - this is your bread and butter.\n✅ Dive into a simple machine learning model (like linear regression) to understand the basics.\n✅ Solve real-world problems with open datasets and share them in a portfolio.\n✅ Build a project that tells a story - why the problem matters, what you found, and what actions it suggests.\n\nData Science & Machine Learning Resources: https://topmate.io/coding/914624\n\nLike if you need similar content 😄👍\n\nHope this helps you 😊\n\n#ai #datascience",
      "sender": "Data Science & Machine Learning",
      "date": "2024-11-27T12:26:06+00:00",
      "is_edited": false,
      "edit_date": null,
      "id": 2014,
      "sender_type": "Channel"
    },
    {
      "text": "If you’re starting out Machine Learning 2025, master these tools early:\n\n1. Python: Your bread and butter.\n2. Pandas: Best for data wrangling.\n3. Scikit-learn: Your go-to for ML basics.\n4. Matplotlib/Seaborn: Visualize everything you analyze.\n5. Jupyter Notebooks: For quick prototyping and visualization.\n\nThe right tools make learning ML 10x more effective.",
      "sender": "Data Science & Machine Learning",
      "date": "2024-11-28T17:17:01+00:00",
      "is_edited": false,
      "edit_date": null,
      "id": 2015,
      "sender_type": "Channel"
    },
    {
      "text": "Data Science & Machine Learning Project Discussions\n👇👇\nhttps://t.me/Kaggle_Group",
      "sender": "Data Science & Machine Learning",
      "date": "2024-11-28T17:41:04+00:00",
      "is_edited": false,
      "edit_date": null,
      "id": 2016,
      "sender_type": "Channel"
    }
  ]
}